InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсОбратный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсЗакупкиСредний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсПродажиСредний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииВалюты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазовойВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/РаботаСВалютой/Ext/Module.bsl
// Пересчитывает Сумму ИзВалюты ВВалюту
//
// Параметры:
//	Сумма 		- Число
//  ВалютаИз	- СправочникСсылка.Валюты 
//  ВалютаВ		- СправочникСсылка.Валюты 
//  Фирма		- СправочникСсылка.Фирмы 
//  НаДату		- Дата (необязательное)
//
Функция Пересчитать2025(Сумма, ВалютаИз, ВалютаВ, Фирма, НаДату = 0, Точность = 0) Экспорт

	ВалютаРубль = гоПараметрСеанса("валюта");
	ВалютаДоллар = гоПараметрСеанса("БазоваяВалюта");
						
	Если ВалютаИз = ВалютаВ Тогда
		
		к = 1;
		
	ИначеЕсли ВалютаИз = ВалютаДоллар И ВалютаВ = ВалютаРубль Тогда
		
		к = Курс(ВалютаИз, НаДату, Фирма);
		
	ИначеЕсли ВалютаИз = ВалютаРубль И ВалютаВ = ВалютаДоллар Тогда
		
		к = 1 / Курс(ВалютаВ, НаДату, Фирма);
		
	Иначе 
	
		БазИз = ?(ЗначениеЗаполнено(ВалютаИз.БазоваяВалюта), 
							ВалютаИз.БазоваяВалюта,
							Фирма.Валюта);
		БазВ = ?(ЗначениеЗаполнено(ВалютаВ.БазоваяВалюта), 
							ВалютаВ.БазоваяВалюта,
							Фирма.Валюта); 
							
		// 1 без кросс-курса
		
		Если БазИз = ВалютаДоллар И ВалютаВ = ВалютаДоллар Тогда 
			
			к = Курс(ВалютаИз, НаДату, Фирма);
			Если ВалютаИз.ОбратныйКурс Тогда
				 к = 1 / к;
			КонецЕсли;
			
		ИначеЕсли БазВ = ВалютаДоллар И ВалютаИз = ВалютаДоллар Тогда 
			
			к = 1 / Курс(ВалютаВ, НаДату, Фирма);
			Если ВалютаВ.ОбратныйКурс Тогда
				 к = 1 / к;
			КонецЕсли;
			
		ИначеЕсли БазИз	= ВалютаРубль И ВалютаВ = ВалютаРубль Тогда 
			
			к = Курс(ВалютаИз, НаДату, Фирма);
			Если ВалютаИз.ОбратныйКурс Тогда
				 к = 1 / к;
			КонецЕсли;
			
		ИначеЕсли БазВ = ВалютаРубль И ВалютаИз = ВалютаРубль Тогда 
			
			к = 1 / Курс(ВалютаВ, НаДату, Фирма);
			Если ВалютаВ.ОбратныйКурс Тогда
				 к = 1 / к;
			КонецЕсли;
			
		// 2 с кросс-курсом
		
		ИначеЕсли БазИз	= БазВ Тогда 
			
			к1 = Курс(ВалютаИз, НаДату, Фирма);
			Если ВалютаИз.ОбратныйКурс Тогда
				 к1 = 1 / к1;
			КонецЕсли;
			к2 = Курс(ВалютаВ, НаДату, Фирма);
			Если ВалютаВ.ОбратныйКурс Тогда
				 к2 = 1 / к2;
			КонецЕсли;
			к = к1 * к2;
			
		// 3 через 2 валюты
		
		ИначеЕсли БазИз = ВалютаДоллар Тогда
		
			к1 = Курс(ВалютаИз, НаДату, Фирма);
			Если ВалютаИз.ОбратныйКурс Тогда
				к1 = 1 / к1;
			КонецЕсли;
			к2 = Курс(ВалютаВ, НаДату, Фирма);
			Если ВалютаВ.ОбратныйКурс Тогда
				к2 = 1 / к2;
			КонецЕсли;   
			к3 = Курс(БазИз, НаДату, Фирма);	
		    к = к1 / к2 * к3;
		
		ИначеЕсли БазВ = ВалютаДоллар Тогда

			к1 = Курс(ВалютаИз, НаДату, Фирма);
			Если ВалютаИз.ОбратныйКурс Тогда
				к1 = 1 / к1;
			КонецЕсли;
			к2 = Курс(ВалютаВ, НаДату, Фирма);
			Если ВалютаВ.ОбратныйКурс Тогда
				к2 = 1 / к2;
			КонецЕсли;   
			к3 = Курс(БазВ, НаДату, Фирма);	
		    к = к1 / к2 / к3;

		КонецЕсли;
	
	КонецЕсли;
	
	Результат = к * Сумма;   
	
	Если Точность <> 0 Тогда
		Результат = Окр(Результат, Точность);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Возвращает курс Валюты на Дату
//
// Параметры:
//  Валюта	- СправочникСсылка.Валюты 
//  НаДату	- Дата (необязательное)
//  Фирма	- СправочникСсылка.Фирмы 
//
Функция Курс(знач Валюта, НаДату = 0, Фирма, Точность = 0) Экспорт 
	
	//Если Валюта.Код = "РУБ" Тогда  
	Если Валюта = гоПараметрСеанса("валюта") Тогда
		// курс рубля записан в долларе :-[
		Валюта = ПараметрыСеанса.БазоваяВалюта;
	КонецЕсли;   
	
	Струк = Новый Структура("Фирма, Валюта", Фирма, Валюта);
	
	Если НаДату = 0 Тогда
		РезСтрук = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(, Струк);
	Иначе
		РезСтрук = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(НаДату, Струк);
	КонецЕсли; 
	
	Курс = РезСтрук.Курс;
	Если Курс = 0 Тогда      
		// последняя запись не содержит значения курса
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Валюта", Валюта);
		Запр.УстановитьПараметр("Фирма", Фирма);
		Запр.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		             |	КурсыВалют.Курс КАК Курс
		             |ИЗ
		             |	РегистрСведений.КурсыВалют КАК КурсыВалют
		             |ГДЕ
		             |	КурсыВалют.Фирма = &Фирма
		             |	И КурсыВалют.Валюта = &Валюта
		             |	И КурсыВалют.Курс > 0
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	КурсыВалют.Период УБЫВ";
		Выборка = Запр.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Курс = Выборка.Курс;
		Иначе
			Курс = 1;
		КонецЕсли;
	КонецЕсли;
	Если Точность <> 0 Тогда
		Курс = Окр(Курс, Точность);
	КонецЕсли;
	
	Возврат Курс;
	
КонецФункции


Функция СреднийКурс(Валюта, Дата, Знач Фирма = Неопределено, ЭтоКурсЗакупки = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Фирма) Тогда
		Фирма = ПараметрыСеанса.Фирма;
	КонецЕсли;
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	КурсыВалютСрезПоследних.Курс КАК Курс,
	             |	КурсыВалютСрезПоследних.КурсЗакупкиСредний КАК КурсЗакупкиСредний,
	             |	КурсыВалютСрезПоследних.КурсПродажиСредний КАК КурсПродажиСредний
	             |ИЗ
	             |	РегистрСведений.КурсыВалют.СрезПоследних(
	             |			&Дата,
	             |			Фирма = &Фирма
	             |				И Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	Запр.УстановитьПараметр("Дата", 	Дата);
	Запр.УстановитьПараметр("Валюта", 	Валюта);
	Запр.УстановитьПараметр("Фирма", 	Фирма);
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если ЭтоКурсЗакупки Тогда
		    Возврат Выборка.КурсЗакупкиСредний;
		Иначе
		    Возврат Выборка.КурсПродажиСредний;
		КонецЕсли;	
	Иначе
		Возврат 0;
	КонецЕсли;	
		
КонецФункции // СреднийКурс()


Функция СредневзвешенныйКурс(Валюта, Касса, Дата) Экспорт

	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ПартииВалютыОстатки.СуммаОстаток КАК Сумма,
	             |	ПартииВалютыОстатки.СуммаВБазовойВалютеОстаток КАК СуммаВБазВалюте
	             |ИЗ
	             |	РегистрНакопления.ПартииВалюты.Остатки(
	             |			&Дата,
	             |			Валюта = &Валюта
	             |				И Касса = &Касса) КАК ПартииВалютыОстатки";
	Запр.УстановитьПараметр("Дата", 	Дата);
	Запр.УстановитьПараметр("Валюта", 	Валюта);
	Запр.УстановитьПараметр("Касса", 	Касса);
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если Валюта.ОбратныйКурс Тогда
			СрКурс = ?(Выборка.СуммаВБазВалюте=0, 0, Выборка.Сумма / Выборка.СуммаВБазВалюте);	
		Иначе
			СрКурс = ?(Выборка.Сумма=0, 0, Выборка.СуммаВБазВалюте / Выборка.Сумма);	
		КонецЕсли;
	Иначе
		СрКурс = 0;
	КонецЕсли;
	
	Возврат СрКурс;
	
КонецФункции // СредневзвешенныйКурс()
